Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser
The Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser class supports the parsing of Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData values
to Tekla.BIM.DirectManipulation.Features.CreationCommandParameter instances.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.IsCreateCommand(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData,Tekla.BIM.DirectManipulation.Features.CreationCommandParameter@)
Determines whether the command describes a create command.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value to determine the command type for.
commandParameter: The command parameters.
Returns: True if command describes a DM creation command; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.IsCreateDotNetPluginCommand(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData)
Determines whether the command describes a create command for any DotNet plug-in type.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value to determine the command type for.
Returns: True if command describes a create command for any DotNet plug-in type; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.GetCreationCommand(System.String,System.String)
Parses the given System.String values to a Tekla.BIM.DirectManipulation.Features.CreationCommandParameter instance.
commandTarget: The target object type of the command.
commandParameter: The parameter of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.GetNumberOfComponentInputPoints(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentData)
Gets the number of input points from the given component data.
componentData: The component data from which to get the number of points.
Returns: The number of input points, or null if the component has some other type of input.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.ParseForComponent(System.String,System.String)
Tries to parse the given System.String values for a component creation command.
commandTarget: The target object type of the command.
commandParameter: The parameter of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.Parse(System.String,System.String)
Tries to parse the given System.String values for a creation command.
commandTarget: The target object type of the command.
commandParameter: The parameter of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.ParseForPart(System.String,System.String)
Tries to parse the given System.String values for a Tekla.Structures.Model.Part creation command.
commandTarget: The target object type of the command.
commandParameter: The parameter of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.ParseForWarehouseItem(System.String,System.String)
Tries to parse the given System.String values for a warehouse item creation command.
commandTarget: The target object type of the command.
commandParameter: The parameter of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.ParseForReinforcement(System.String,System.String)
Tries to parse the given System.String values for a Tekla.Structures.Model.Reinforcement creation command.
commandTarget: The target object type of the command.
commandParameter: The parameter of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.ParseForBentPlate(System.String,System.String)
Tries to parse the given System.String values for a Bent Plate creation command.
commandTarget: The target object type of the command.
commandParameter: The parameter of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.ParseForHelix(System.String,System.String)
Tries to parse the given System.String values for a Helix creation command.
commandTarget: The target object type of the command.
commandParameter: The parameter of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.ParseForConstructionObject(System.String)
Tries to parse the given System.String values for a construction object creation command.
commandTarget: The target object type of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.ParseForGrid(System.String)
Tries to parse the given System.String values for a grid creation command.
commandTarget: The target object type of the command.
Returns: The creation command parameter, if any.

Tekla.Structures.DirectManipulation.Adapter.State.CreationCommandParser.ParseForView(System.String,System.String)
Tries to parse the given System.String values for a view creation command.
commandTarget: The target object type of the command.
commandParameter: The command parameter.
Returns: The creation command parameter, if any.